IRP/src/Documents/CalculationDeservedVacations/CalculationDeservedVacations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CalculationDeservedVacations</name>
  <registerRecords>AccumulationRegister.R9541T_VacationUsage</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>BeginDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

IRP/src/InformationRegisters/T9510S_Staffing/T9510S_Staffing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T9510S_Staffing</name>
 <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
 <writeMode>RecorderSubordinate</writeMode>
 <resources>
  <name>Fired</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <resources>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </resources>
 <resources>
  <name>Position</name>
  <type>
   <types>CatalogRef.EmployeePositions</types>
  </type>
 </resources>
 <resources>
  <name>EmployeeSchedule</name>
  <type>
   <types>CatalogRef.EmployeeSchedule</types>
  </type>
 </resources>
 <resources>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </resources>
 <dimensions>
  <name>Employee</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/T9545S_VacationDaysLimits/T9545S_VacationDaysLimits.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T9545S_VacationDaysLimits</name>
 <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
 <resources>
  <name>DayLimit</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </resources>
 <attributes>
  <name>Document</name>
  <type>
   <types>DocumentRef.EmployeeHiring</types>
  </type>
 </attributes>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Employee</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/AccumulationRegisters/R9541T_VacationUsage/R9541T_VacationUsage.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R9541T_VacationUsage</name>
 <resources>
  <name>Days</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>5</precision>
   </numberQualifiers>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Employee</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Catalogs/Partners/Partners.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Partners</name>
 <hierarchical>true</hierarchical>
 <hierarchyType>HierarchyOfItems</hierarchyType>
 <attributes>
  <name>Customer</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Vendor</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Employee</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Consignor</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgent</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Other</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ManagerSegment</name>
  <type>
   <types>CatalogRef.PartnerSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>TaxID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>DefaultCarrier</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Email</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>200</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Country</name>
  <type>
   <types>CatalogRef.Countries</types>
  </type>
 </attributes>
 <attributes>
  <name>MainPhoneNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>MainAddress</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Documents/CalculationDeservedVacations/ManagerModule.bsl
#Region PrintForm

Function GetPrintForm(Ref, PrintFormName, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

#EndRegion

#Region Posting

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = New Structure;
	QueryArray = GetQueryTextsSecondaryTables();
	Parameters.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	Return Tables;
EndFunction

Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map;
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = Parameters.DocumentDataTables;
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.SetRegisters(Tables, Ref);

	PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map;
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters);
	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region Undoposting

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return PostingGetDocumentDataTables(Ref, Cancel, Undefined, Parameters, AddInfo);
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map;
	Return DataMapWithLockFields;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Parameters.Insert("Unposting", True);
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region CheckAfterWrite

Procedure CheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined)
	Return;
EndProcedure

#EndRegion

#Region Posting_Info

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure;
	Str.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	Str.Insert("QueryTextsMasterTables", GetQueryTextsMasterTables());
	Str.Insert("QueryTextsSecondaryTables", GetQueryTextsSecondaryTables());
	Return Str;
EndFunction

Function GetAdditionalQueryParameters(Ref)
	RefData = CommonFunctionsServer.GetAttributesFromRef(Ref, "Company, EndDate");
	
	StrParams = New Structure;
	StrParams.Insert("Ref", Ref);
	StrParams.Insert("Company", RefData.Company);
	StrParams.Insert("Period", EndOfDay(RefData.EndDate));
	StrParams.Insert("BeforEnd", New Boundary(EndOfDay(RefData.EndDate), BoundaryType.Excluding));
	Return StrParams;
EndFunction

Function GetQueryTextsSecondaryTables()
	QueryArray = New Array;
	Return QueryArray;
EndFunction

Function GetQueryTextsMasterTables()
	QueryArray = New Array;
	QueryArray.Add(R9541T_VacationUsage());
	Return QueryArray;
EndFunction

#EndRegion

#Region Posting_SourceTable

#EndRegion

#Region Posting_MainTables

Function R9541T_VacationUsage()
	
	Return
		"SELECT
		|	T9510S_StaffingSliceLast.Company,
		|	T9510S_StaffingSliceLast.Employee
		|INTO tmpStaff
		|FROM
		|	InformationRegister.T9510S_Staffing.SliceLast(&Period, Company = &Company) AS T9510S_StaffingSliceLast
		|WHERE
		|	NOT T9510S_StaffingSliceLast.Fired
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	tmpStaff.Company,
		|	tmpStaff.Employee,
		|	CASE
		|		WHEN NOT EmployeeCompanyLimits.DayLimit IS NULL
		|			THEN EmployeeCompanyLimits.DayLimit
		|		WHEN NOT EmployeeLimits.DayLimit IS NULL
		|			THEN EmployeeLimits.DayLimit
		|		WHEN NOT CompanyLimits.DayLimit IS NULL
		|			THEN CompanyLimits.DayLimit
		|		WHEN NOT AllLimits.DayLimit IS NULL
		|			THEN AllLimits.DayLimit
		|		ELSE 0
		|	END AS DayLimit
		|INTO tmpDayLimits
		|FROM
		|	tmpStaff AS tmpStaff
		|		LEFT JOIN InformationRegister.T9545S_VacationDaysLimits.SliceLast(&BeforEnd,) AS AllLimits
		|		ON AllLimits.Company = VALUE(Catalog.Companies.EmptyRef)
		|		AND AllLimits.Employee = VALUE(Catalog.Partners.EmptyRef)
		|		LEFT JOIN InformationRegister.T9545S_VacationDaysLimits.SliceLast(&BeforEnd,) AS CompanyLimits
		|		ON tmpStaff.Company = CompanyLimits.Company
		|		AND CompanyLimits.Employee = VALUE(Catalog.Partners.EmptyRef)
		|		LEFT JOIN InformationRegister.T9545S_VacationDaysLimits.SliceLast(&BeforEnd,) AS EmployeeLimits
		|		ON tmpStaff.Employee = EmployeeLimits.Employee
		|		AND EmployeeLimits.Company = VALUE(Catalog.Companies.EmptyRef)
		|		LEFT JOIN InformationRegister.T9545S_VacationDaysLimits.SliceLast(&BeforEnd,) AS EmployeeCompanyLimits
		|		ON tmpStaff.Company = EmployeeCompanyLimits.Company
		|		AND tmpStaff.Employee = EmployeeCompanyLimits.Employee
		|WHERE
		|	CASE
		|		WHEN NOT EmployeeCompanyLimits.DayLimit IS NULL
		|			THEN EmployeeCompanyLimits.DayLimit
		|		WHEN NOT EmployeeLimits.DayLimit IS NULL
		|			THEN EmployeeLimits.DayLimit
		|		WHEN NOT CompanyLimits.DayLimit IS NULL
		|			THEN CompanyLimits.DayLimit
		|		WHEN NOT AllLimits.DayLimit IS NULL
		|			THEN AllLimits.DayLimit
		|		ELSE 0
		|	END > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	tmpDayLimits.Company,
		|	tmpDayLimits.Employee,
		|	tmpDayLimits.DayLimit,
		|	INT((DATEDIFF(BEGINOFPERIOD(&Period, Year), &Period, DAY) + 1) / (DATEDIFF(BEGINOFPERIOD(&Period, Year),
		|		ENDOFPERIOD(&Period, Year), DAY) + 1) * tmpDayLimits.DayLimit) - ISNULL(R9541T_VacationUsageTurnovers.DaysReceipt,
		|		0) AS Days
		|INTO tmpDeservedDays
		|FROM
		|	tmpDayLimits AS tmpDayLimits
		|		LEFT JOIN AccumulationRegister.R9541T_VacationUsage.Turnovers(BEGINOFPERIOD(&Period, Year), &BeforEnd,,) AS
		|			R9541T_VacationUsageTurnovers
		|		ON tmpDayLimits.Company = R9541T_VacationUsageTurnovers.Company
		|		AND tmpDayLimits.Employee = R9541T_VacationUsageTurnovers.Employee
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		|	&Period AS Period,
		|	tmpDeservedDays.Company,
		|	tmpDeservedDays.Employee,
		|	tmpDeservedDays.Days
		|INTO R9541T_VacationUsage
		|FROM
		|	tmpDeservedDays AS tmpDeservedDays
		|WHERE
		|	tmpDeservedDays.Days > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|DROP tmpStaff
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|DROP tmpDayLimits
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|DROP tmpDeservedDays";
	
EndFunction

#EndRegion

#Region AccessObject

// Get access key.
// 
// Parameters:
//  Obj - DocumentObjectDocumentName -
// 
// Returns:
//  Map
Function GetAccessKey(Obj) Export
	AccessKeyMap = New Map;
	AccessKeyMap.Insert("Company", Obj.Company);
	Return AccessKeyMap;
EndFunction

#EndRegion
